# Yosys synthesis script for DSP Engine

read_liberty -lib /home/faiz/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib

read_verilog resources/dsp_engine.v

hierarchy -check -top dsp_engine

proc
flatten
opt

techmap
opt

dfflibmap -liberty /home/faiz/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib

abc -liberty /home/faiz/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib

opt_clean -purge

stat

write_verilog -noattr results/dsp_engine_synth.v
